Catalogs/Renault_ТарифыНаАвтомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ТарифыНаАвтомобили</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенКорпКлиентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_ТарифыНаАвтомобили/Ext/ManagerModule.bsl
Функция ПолучитьТарифДляРасчетаЦены(Год = Неопределено) Экспорт
	
	Если ТипЗнч(Год) = Тип("Дата") Тогда
		Год = Год(Год);
	КонецЕсли;
	
	Попытка
		Автосклад_ЦеныАМПрежнихГодовСчитатьПоПоследнемуТарифу = 
			Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.Автосклад_ЦеныАМПрежнихГодовСчитатьПоПоследнемуТарифу;
	Исключение
		Автосклад_ЦеныАМПрежнихГодовСчитатьПоПоследнемуТарифу = Ложь;	
	КонецПопытки;
	
	Если Год = Неопределено 
		Или Год >= Год(ТекущаяДата()) 
		или Год < Год(ТекущаяДата()) И Автосклад_ЦеныАМПрежнихГодовСчитатьПоПоследнемуТарифу Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Renault_ТарифыНаАвтомобили.Ссылка
		               |ИЗ
		               |	Справочник.Renault_ТарифыНаАвтомобили КАК Renault_ТарифыНаАвтомобили
		               |ГДЕ
		               |	(Renault_ТарифыНаАвтомобили.Активен = ИСТИНА
		               |				И Renault_ТарифыНаАвтомобили.ОкончаниеДействия >= &ДатаТарифа
		               |			ИЛИ Renault_ТарифыНаАвтомобили.ОкончаниеДействия = &ПустаяДата)
		               |	И Renault_ТарифыНаАвтомобили.НачалоДействия <= &ДатаТарифа
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Renault_ТарифыНаАвтомобили.НачалоДействия УБЫВ";
		Запрос.УстановитьПараметр("ДатаТарифа", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		Иначе
			Возврат Справочники.Renault_ТарифыНаАвтомобили.ПустаяСсылка();
		КонецЕсли;
		
	ИначеЕсли Год < Год(ТекущаяДата()) И Не Автосклад_ЦеныАМПрежнихГодовСчитатьПоПоследнемуТарифу Тогда
		
		КонтрольнаяДатаВПрошломГоду = КонецГода(ТекущаяДата() - 365*24*3600);
		Если Год(КонтрольнаяДатаВПрошломГоду) = Год(ТекущаяДата()) Тогда
			КонтрольнаяДатаВПрошломГоду = КонецГода(ТекущаяДата() - 366*24*3600);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ Первые 1
		               |	Renault_ТарифыНаАвтомобили.Ссылка
		               |ИЗ
		               |	Справочник.Renault_ТарифыНаАвтомобили КАК Renault_ТарифыНаАвтомобили
		               |ГДЕ
		               |	(Renault_ТарифыНаАвтомобили.ОкончаниеДействия >= &ДатаТарифа
		               |			ИЛИ Renault_ТарифыНаАвтомобили.ОкончаниеДействия = &ПустаяДата)
		               |	И Renault_ТарифыНаАвтомобили.НачалоДействия <= &ДатаТарифа
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Renault_ТарифыНаАвтомобили.НачалоДействия УБЫВ";
		Запрос.УстановитьПараметр("ДатаТарифа", НачалоДня(КонтрольнаяДатаВПрошломГоду));
		Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		Иначе
			Возврат Справочники.Renault_ТарифыНаАвтомобили.ПустаяСсылка();
		КонецЕсли;
	
	КонецЕсли;
	
КонецФункции
